# ArcCenterMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArcCenterMark Property
ParameterTypeId Class See Also
---
"Center Marks"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArcCenterMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcCenterMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArcCenterMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace